@ms-henglu 
```
Terraform will perform the following actions:

  # module.container-app.data.azapi_resource.container_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_resource" "container_app" {
      + exists                 = (known after apply)
      + id                     = (known after apply)
      + identity               = (known after apply)
      + location               = (known after apply)
      + name                   = "ca-rei-rcpa-dataset-se1qa"
      + output                 = (known after apply)
      + parent_id              = "<some_value>"
      + resource_id            = (known after apply)
      + response_export_values = [
          + "*",
        ]
      + tags                   = (known after apply)
      + type                   = "Microsoft.App/containerApps@2025-01-01"
    }

  # module.container-app.azapi_resource.this_container_app will be updated in-place
  ~ resource "azapi_resource" "this_container_app" {
      ~ body                      = {
          ~ properties = {
              ~ template            = {
                  ~ containers     = [
                      ~ {
                          ~ image        = "<some_value>"
                            name         = "rcpa-dataset"
                            # (6 unchanged attributes hidden)
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
        }
        id                        = "<some_value>"
        name                      = "ca-rei-rcpa-dataset-se1qa"
      ~ output                    = {
          - id         = "<some_value>"
          - identity   = {
              - userAssignedIdentities = {
                  - "<some_value>"   = {
                      - clientId    = "<some_value>"
                      - principalId = "<some_value>"
                    }
                  - "<some_value>" = {
                      - clientId    = "<some_value>"
                      - principalId = "<some_value>"
                    }
                }
            }
          - properties = {
              - configuration              = {
                  - ingress = {
                      - corsPolicy    = {
                          - allowedHeaders = [
                              - "*",
                            ]
                          - allowedMethods = [
                              - "GET",
                              - "PUT",
                              - "POST",
                              - "DELETE",
                              - "OPTIONS",
                            ]
                          - allowedOrigins = [
                              - "<some_value>",
                              - "http://localhost:8080",
                              - "<some_value>",
                            ]
                          - exposeHeaders  = [
                              - "*",
                            ]
                        }
                      - customDomains = [
                          - {},
                        ]
                      - fqdn          = "<some_value>"
                      - traffic       = [
                          - {},
                        ]
                    }
                  - secrets = [
                      - {},
                    ]
                }
              - customDomainVerificationId = "F82CF45E4094C4FAE0DA45E7BA919647F826A2EF592EAB1DE8512AC81B2B8808"
              - eventStreamEndpoint        = "<some_value>"
              - latestReadyRevisionName    = "<some_value>"
              - latestRevisionFqdn         = "<some_value>"
              - latestRevisionName         = "<some_value>"
              - outboundIpAddresses        = [
                  - "<some_value>",
                ]
              - provisioningState          = "Succeeded"
              - runningStatus              = "Running"
              - template                   = {
                  - containers = [
                      - {
                          - env       = [
                              - {},
                              - {},
                              - {},
                              - {},
                              - {},
                              - {},
                              - {},
                              - {},
                              - {},
                              - {},
                            ]
                          - resources = {
                              - ephemeralStorage = "8Gi"
                            }
                        },
                    ]
                  - scale      = {
                      - rules = [
                          - {
                              - custom = {
                                  - metadata = {
                                      - type  = "Utilization"
                                      - value = "70"
                                    }
                                }
                            },
                          - {
                              - custom = {
                                  - metadata = {
                                      - type  = "Utilization"
                                      - value = "70"
                                    }
                                }
                            },
                        ]
                    }
                }
            }
          - tags       = {
              - Component          = "Dataset API"
              - Lifecycle          = "Staging"
              - monitoring         = "datadog"
            }
          - type       = "Microsoft.App/containerApps"
        } -> (known after apply)
        tags                      = {
            "Component"          = "Dataset API"
            "Lifecycle"          = "Staging"
            "monitoring"         = "datadog"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```